nestedkernel/PerspicuOS/FreeBSD9-orig/share/man/man4/idt.4
.\" $FreeBSD: release/9.0.0/share/man/man4/idt.4 130650 2004-06-17 19:51:17Z ru $
.\"
.Dd June 3, 2003
.Dt IDT 4
.Os
.Sh NAME
.Nm idt
.Nd device driver for IDT NICStAR-based ATM interfaces
.Sh SYNOPSIS
.Cd "device idt"
.Cd "device atm"
.Sh DESCRIPTION
The
.Nm
device driver supports ATM network interfaces based on the
IDT NICStAR 77211 controller, including the FORE Systems
ForeRunner LE25 and LE155.
For configuring the card for IP see
.Xr natmip 4 .
.Pp
ATM CBR connections are supported, and bandwidth is allocated in
slots of 64k each.
Three VBR queues handle traffic for VBR and UBR.
Two UBR queues prioritize UBR traffic.
ILMI and signalling get the higher priority queue, as well as UBR traffic
that specifies a peak cell rate.
All other UBR traffic goes into the lower queue.
.Pp
The following sysctls are recognized by the driver:
.Bl -tag -width indent
.It Va hw.idt.log_bufstat
Print statistics about buffer use to the system log periodically.
.It Va hw.idt.log_vcs
Print information about VC opens, closes, and other events to the system log.
.It Va hw.idt.bufs_large
Set or print the maximum size of the 2KB buffer queue.
.It Va hw.idt.bufs_small
Set or print the maximum size of the mbuf queue.
.It Va hw.idt.cur_large
Print the current size of the 2KB buffer queue.
.It Va hw.idt.cur_small
Print the current size of the mbuf queue.
.It Va hw.idt.qptr_hold
Optimize the TX queue buffer for lowest overhead.
.El
.Sh SEE ALSO
.Xr natm 4 ,
.Xr natmip 4 ,
.Xr ifconfig 8 ,
.Xr route 8
.Sh AUTHORS
.An -nosplit
.An Richard Hodges ,
based on the original driver for
.Fx 2.2
by
.An Mark Tinguely .
.An Bruce M. Simpson
wrote this manual page and backported the driver to
.Fx 4.9 .
